# Question 1
Consider the following Python module:
a = 0
def b():
 global a
 a = c(a)
def c(a):
 return a + 2
After importing the module into the interpreter, you execute:
>>> b()
>>> b()
>>> b()
>>> a
?
What value is displayed when the last expression (a) is evaluated? Explain your
answer by indicating what happens in every executed statement.:

In [2]:
# This code calculates the final value of a after calling b() multiple times.
a = 0

def b():
    global a
    a = c(a)

def c(a):
    return a + 2

# Call b() three times
b()  # Sets a to 2
b()  # Sets a to 4
b()  # Sets a to 6
print(a)  # Final output is 6

6

# Question 2
Function fileLength(), given to you, takes the name of a file as input and returns
the length of the file:
>>> fileLength('midterm.py')
284
>>> fileLength('idterm.py')
Traceback (most recent call last):
File "<pyshell#34>", line 1, in <module>
 fileLength('idterm.py')
File "/Users/me/midterm.py", line 3, in fileLength
 infile = open(filename)
FileNotFoundError: [Errno 2] No such file or directory:
'idterm.py'
As shown above, if the file cannot be found by the interpreter or if it cannot be read
as a text file, an exception will be raised. Modify function fileLength() so that a
friendly message is printed instead:
>>> fileLength('midterm.py')
358
>>> fileLength('idterm.py')
File idterm.py not found.

In [26]:
def file_length(file_name): #  input is the filename// Returns the lenght.
    try:
        file = open(file_name,'r')
        content = file.read()
        file.close()
        print(len(content))
    except FileNotFoundError as file_error_customized:
        print('File {} not found'.format(file_name))  # it will Return the customized error if file not found.

In [30]:
file_length('Filelength.txt')

123

In [32]:
file_length('idterm.py')

File idterm.py not found

# Question 3
Write a class named Marsupial that can be used as shown below:
>>> m = Marsupial()
>>> m.put_in_pouch('doll')
>>> m.put_in_pouch('firetruck')
>>> m.put_in_pouch('kitten')
>>> m.pouch_contents()
['doll', 'firetruck', 'kitten']
 BDAT 1004 ‚Äì Data Programming
Page 3 of 7
F2021
BDAT 1004 Computer Studies
Now write a class named Kangaroo as a subclass of Marsupial that inherits all the
attributes of Marsupial and also:
a. extends the Marsupial __init__ constructor to take, as input, the
coordinates x and y of the Kangaroo object,
b. supports method jump that takes number values dx and dy as input and
moves the kangaroo by dx units along the x-axis and by dy units along the yaxis, and
c. overloads the __str__ operator so it behaves as shown below.
>>> k = Kangaroo(0,0)
>>> print(k)
I am a Kangaroo located at coordinates (0,0)
>>> k.put_in_pouch('doll')
>>> k.put_in_pouch('firetruck')
>>> k.put_in_pouch('kitten')
>>> k.pouch_contents()
['doll', 'firetruck', 'kitten']
>>> k.jump(1,0)
>>> k.jump(1,0)
>>> k.jump(1,0)
>>> print(k)
I am a Kangaroo located at coordinates (3,0)

In [35]:
class Marsupial:   # Marsupial Class
    itemL=[]

    def put_in_pouch(self,item):
        self.itemL.append(item)

    def pouch_contents(self):
        return self.itemL

m=Marsupial()
m.put_in_pouch("doll")
m.put_in_pouch("firetruck")
m.put_in_pouch("kitten")
m.pouch_contents()

['doll', 'firetruck', 'kitten']

Second part of the answer:

In [38]:
class Kangaroo(Marsupial):    # class called Kangaroo
    def __init__(self,x1,y1):
        self.x = x1
        self.y = y1
        Marsupial.__init__(self)

    def jump(self,x1,y1):
        self.x = self.x + x1
        self.y = self.y + y1

    def __str__(self):
        return 'I am a Kangaroo located at coordinates ({}, {})'.format(self.x, self.y)



k = Kangaroo(0,0)
print (k)

I am a Kangaroo located at coordinates (0, 0)

In [40]:
k.put_in_pouch("doll")
k.put_in_pouch("firetruck")
k.put_in_pouch("kitten")
k.pouch_contents()

['doll', 'firetruck', 'kitten', 'doll', 'firetruck', 'kitten']

In [42]:
k.jump(1,0)
k.jump(1,0)
k.jump(1,0)
print(k)

I am a Kangaroo located at coordinates (3, 0)

# Question 4

Write function collatz() that takes a positive integer x as input and prints the Collatz sequence starting at x. A Collatz sequence is obtained by repeatedly applying this rule to the previous number x in the sequence:

x = { ùë•/2	ùëñùëì ùë• ùëñùë† ùëíùë£ùëíùëõ 3ùë• + 1	 ùëñùëì ùë• ùëñùë† ùëúùëëùëë

Your function should stop when the sequence gets to number 1. Your implementation must be recursive, without any loops.

In [45]:
def collatz(num):

    if(num==1):
        print(1)
        return
    print(int(num))

    if(num%2==0): #odd or even
        num=num/2
    else:
        num=3*num+1
    return(collatz(num))

In [47]:
collatz(1)

1

In [49]:
collatz(10)

10
5
16
8
4
2
1

# Question 5

Write a recursive method binary() that takes a non-negative integer n and prints the binary representation of integer n.

binary(0) 0

binary(1) 1

binary(3) 11

binary(9) 1001

In [52]:
def binary(integer):         #defining a function called binary.

    try:
        if(integer<0):
            raise ValueError        #check whether the number is less than zero and raise the value error if true.
        if integer > 1:
            binary(integer//2)            # assigning the original value with the floor division of 2 calculated into it
        print (integer % 2, end = '')     # for get the  remainder
    except ValueError:
        print('Value should not be negative.')

In [54]:
binary(0)

0

In [56]:
binary(1)

1

In [58]:
binary(3)

11

In [60]:
binary(9)

1001

# Question 6

Implement a class named HeadingParser that can be used to parse an HTML document, and retrieve and print all the headings in the document. You should implement your class as a subclass of HTMLParser, defined in Standard Library module html.parser. When fed a string containing HTML code, your class should print the headings, one per line and in the order in which they appear in the document. Each heading should be indented as follows: an h1 heading should have indentation 0, and h2 heading should have indentation 1, etc. Test your implementation using w3c.html.

infile = open('w3c.html')

content = infile.read()

infile.close()

hp = HeadingParser()

hp.feed(content)

W3C Mission Principles

In [102]:
from html.parser import HTMLParser

class HeadingParser(HTMLParser):

    def __init__(self):
        super().__init__()
        self.tag = None  # Initialize self.tag to None

    def handle_starttag(self, tag, attrs):   # start function
        self.tag = tag

    def handle_data(self, data):               # heading of HTML
        if self.tag in ['h1','h2','h3','h4','h5','h6']:
            n=int(self.tag[1])
            print (n*' '+data, end = '')

infile = open('w3c.html')  #HTML location
content = infile.read()
infile.close()
parser = HeadingParser()
parser.feed(content)

 W3C Mission
	  Principles

# Question 7

Implement recursive function webdir() that takes as input: a URL (as a string) and non-negative integers depth and indent. Your function should visit every web page reachable from the starting URL web page in depth clicks or less, and print each web page's URL.
As shown below, indentation, specified by indent, should be used to indicate the depth of a URL.

webdir('http://reed.cs.depaul.edu/lperkovic/csc242/test1.html'
, 2, 0)
http://reed.cs.depaul.edu/lperkovic/csc242/test1.html http://reed.cs.depaul.edu/lperkovic/csc242/test2.html
http://reed.cs.depaul.edu/lperkovic/csc242/test4.html http://reed.cs.depaul.edu/lperkovic/csc242/test3.html
http://reed.cs.depaul.edu/lperkovic/csc242/test4.html

In [66]:
from html.parser import HTMLParser
from urllib.request import urlopen
from urllib.parse import urljoin

class Appender(HTMLParser):


    def __init__(self, url):

        HTMLParser.__init__(self)
        self.url = url
        self.url_links = []


    def append(self):

        return self.url_links




    def handle_starttag(self, url_tag, attributes):
        for a in attributes:
            ab = urljoin(self.url, a[1])
            if ab[:4] == 'http':
                self.url_links.append(ab)
i = 0
def webdir(url, depth, i):


    depth = depth - 1
    print(i*'  ', url)

    objective = urlopen(url).read().decode()
    collection = Appender(url)
    collection.feed(objective)
    urls = collection.append()

    url_links = urls
    i= i + 4


    for link in url_links:
        if depth < 0 or i < 0:
            return 1
        else:
            webdir(link, depth, i)



webdir('http://reed.cs.depaul.edu/lperkovic/test1.html', 2, 0)

 http://reed.cs.depaul.edu/lperkovic/test1.html
         http://reed.cs.depaul.edu/lperkovic/test2.html
                 http://reed.cs.depaul.edu/lperkovic/test4.html
         http://reed.cs.depaul.edu/lperkovic/test3.html
                 http://reed.cs.depaul.edu/lperkovic/test4.html

# Question 8

Write SQL queries on the below database table that return:

 a) All the temperature data.

 b) All the cities, but without repetition.

 c) All the records for India.

 d) All the Fall records.

 e) The city, country, and season for which the average rainfall is between 200 and 400 millimeters.

  f) The city and country for which the average Fall temperature is above 20 degrees, in increasing temperature order.
  
  g) The total annual rainfall for Cairo.
  
  h) The total rainfall for each season.

City Country Season Temperature (C) Rainfall (mm) Mumbai India Winter 24.8 5.9 Mumbai India Spring 28.4 16.2 Mumbai India Summer 27.9 1549.4 Mumbai India Fall 27.6 346.0 London United Kingdom Winter 4.2 207.7 London United Kingdom Spring 8.3 169.6 London United Kingdom Summer 15.7 157.0 London United Kingdom Fall 10.4 218.5 Cairo Egypt Winter 13.6 16.5 Cairo Egypt Spring 20.7 6.5 Cairo Egypt Summer 27.7 0.1 Cairo Egypt Fall 22.2 4.5

In [69]:
%load_ext sql

In [71]:
%sql sqlite://

In [73]:
%%sql
CREATE TABLE Record(City varchar(50), Country varchar(50), Season varchar(50), Temperature int, Rainfall int);
INSERT INTO Record VALUES
('Mumbai','India', 'Winter',24.8,5.9),
('Mumbai','India', 'Spring',28.8,16.2),
('Mumbai','India', 'Summer',27.9,1549.4),
('Mumbai','India', 'Fall',27.6,346.0 ),
('London','United Kingdom','Winter',4.2,207.7 ),
('London','United Kingdom','Spring',8.3,169.6 ),
('London','United Kingdom','Summer', 15.7,157.0),
('London','United Kingdom','Fall', 10.4,218.5),
('Cairo','Egypt','Winter', 13.6,16.5),
('Cairo','Egypt','Spring', 20.7,6.5),
('Cairo','Egypt','Summer',27.7,0.1),
('Cairo','Egypt','Fall', 22.2,4.5);
select * from record;

 * sqlite://
Done.
12 rows affected.
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.8, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346),
 ('London', 'United Kingdom', 'Winter', 4.2, 207.7),
 ('London', 'United Kingdom', 'Spring', 8.3, 169.6),
 ('London', 'United Kingdom', 'Summer', 15.7, 157),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Winter', 13.6, 16.5),
 ('Cairo', 'Egypt', 'Spring', 20.7, 6.5),
 ('Cairo', 'Egypt', 'Summer', 27.7, 0.1),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

 a) All the temperature data.

In [75]:
%sql SELECT Temperature FROM Record;

 * sqlite://
Done.

[(24.8,),
 (28.8,),
 (27.9,),
 (27.6,),
 (4.2,),
 (8.3,),
 (15.7,),
 (10.4,),
 (13.6,),
 (20.7,),
 (27.7,),
 (22.2,)]

b) All the cities, but without repetition.

In [78]:
%sql SELECT DISTINCT City FROM Record;

 * sqlite://
Done.

[('Mumbai',), ('London',), ('Cairo',)]

c) All the records for India.

In [81]:
%sql SELECT * FROM Record WHERE Country = 'India';

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.8, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346)]

d) All the Fall record

In [84]:
%sql SELECT * FROM Record WHERE Season = 'Fall';

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall', 27.6, 346),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

e) The city, country, and season for which the average rainfall is between 200 and 400 millimeters.

In [87]:
%sql SELECT City, Country, Season FROM Record WHERE Rainfall BETWEEN 200 And 400;

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall'),
 ('London', 'United Kingdom', 'Winter'),
 ('London', 'United Kingdom', 'Fall')]

f) The city and country for which the average Fall temperature is above 20 degrees, in increasing temperature order.

In [90]:
%sql SELECT City, Country FROM Record WHERE Season = 'Fall' AND Temperature >20 ORDER BY Temperature ASC;

 * sqlite://
Done.

[('Cairo', 'Egypt'), ('Mumbai', 'India')]

g) The total annual rainfall for Cairo.

In [93]:
%sql SELECT Sum(Rainfall) as Total_Annual_Rainfall FROM record WHERE City='Cairo';

 * sqlite://
Done.

[(27.6,)]

h) The total rainfall for each season

In [96]:
%sql SELECT Season, round(Sum(Rainfall),1) as Total_Rainfall FROM record GROUP BY Season;

 * sqlite://
Done.

[('Fall', 569.0), ('Spring', 192.3), ('Summer', 1706.5), ('Winter', 230.1)]

# Question 9
Suppose list words is defined as follows:

words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

Write list comprehension expressions that use list words and generate the following lists:

a)	['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']

b)	['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

c)	[3, 5, 5, 3, 5, 4, 3, 4, 3] (the list of lengths of words in list
words).

d)	[['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN',
'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5],
['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy',
4], ['DOG', 'dog', 3]] (the list containing a list for every word of list words, where each list contains the word in uppercase and lowercase and the length of the word.)

e)	['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog'] (the list of words in list words containing 4 or more characters.)

In [100]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

print('Write list comprehension expressions that use list words and generate the following lists')
print()

print('A) Convert all letters from words in uppercase:')
print([p.upper() for p in words])
print()

print('B) Convert all letters from words in lowercase:')
print([p.lower() for p in words])
print()

print('C) The list of lengths of words in list words:')
print([len(p) for p in words])
print()

print('D) The list containing a list for every word of list words, where each list contains the word in uppercase abd lowercase and the length of the word:')
print([[p.upper(), p.lower(), len(p)] for p in words])
print()

print('E) The list of words in list words containing 4 or more characters:')
print([p for p in words if len(p)>=4])
print()

Write list comprehension expressions that use list words and generate the following lists

A) Convert all letters from words in uppercase:
['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']

B) Convert all letters from words in lowercase:
['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

C) The list of lengths of words in list words:
[3, 5, 5, 3, 5, 4, 3, 4, 3]

D) The list containing a list for every word of list words, where each list contains the word in uppercase abd lowercase and the length of the word:
[['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN', 'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5], ['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy', 4], ['DOG', 'dog', 3]]

E) The list of words in list words containing 4 or more characters:
['quick', 'brown', 'jumps', 'over', 'lazy']